{
  "symbol": "MLM",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:37.707171",
  "data": {
    "address": "4123 Parklake Ave",
    "alias": null,
    "city": "Raleigh",
    "country": "US",
    "currency": "USD",
    "cusip": "573284106",
    "description": "Martin Marietta Materials, Inc. is a natural resource-based building materials company, which engages in the provision of aggregates including crushed stone, sand, and gravel through its network of quarries and distribution yards. The company is headquartered in Raleigh, North Carolina and currently employs 9,400 full-time employees.  The firm supplies aggregates (crushed stone, sand and gravel) through its network of approximately 390 quarries, mines and distribution yards in 28 states, Canada and The Bahamas. The company also provides cement and downstream products, namely, ready mixed concrete, asphalt and paving services in targeted markets. The company conducts its Building Materials business through two segments, organized by geography: East Group and West Group. The East Group provides aggregates and asphalt products. The West Group provides aggregates, cement, downstream products and paving services. The Company’s Magnesia Specialties business provides a full range of magnesium oxide, magnesium hydroxide and dolomitic lime products. Its magnesia-based chemical products are used in industrial, agricultural and environmental applications. The company also produces dolomitic lime sold to customers for steel production and soil stabilization.",
    "employeeTotal": 9400,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Construction",
    "floatingShare": 59.82,
    "fundamentalFreq": "q",
    "ggroup": "Materials",
    "gind": "Construction Materials",
    "gsector": "Materials",
    "gsubind": "Construction Materials",
    "insiderOwnership": 0.6893,
    "institutionOwnership": 101.0561,
    "ipo": "1994-02-17",
    "irUrl": "https://ir.martinmarietta.com",
    "isin": "US5732841060",
    "lei": "5299005MZ4WZECVATV08",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/MLM.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 37413.84476482409,
    "marketcapUSD": 0,
    "naics": "Nonmetallic Mineral Mining and Quarrying",
    "naicsNationalIndustry": "Crushed and Broken Limestone Mining and Quarrying",
    "naicsSector": "Mining, Quarrying, and Oil and Gas Extraction",
    "naicsSubsector": "Mining (except Oil and Gas)",
    "name": "Martin Marietta Materials Inc",
    "phone": "19197814550",
    "sedol": "2572079",
    "shareOutstanding": 60.31,
    "state": "NORTH CAROLINA",
    "ticker": "MLM",
    "usShare": 0,
    "weburl": "https://www.martinmarietta.com/"
  }
}