{
  "symbol": "COIN",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:47:30.724642",
  "data": {
    "address": "One Madison Avenue, Suite 2400",
    "alias": null,
    "city": "New York City",
    "country": "US",
    "currency": "USD",
    "cusip": "19260Q107",
    "description": "Coinbase Global, Inc. engages in the provision of a trusted platform that serves as a compliant on-ramp to the onchain economy and enables users to engage in a wide variety of activities with their crypto assets in both proprietary and third-party product experiences enabled by access to decentralized applications. The company is headquartered in New York City, New York and currently employs 3,772 full-time employees. The company went IPO on 2021-04-14. The firm provides a platform for its customers to engage with crypto assets and offers critical infrastructure for the onchain economy. The company offers products and services to three customer groups: Consumers, Institutions, and Developers. Consumers include retail customers seeking to invest in or trade crypto assets and engage onchain. Institutions consist of businesses that include market makers, asset managers, hedge funds, banks, wealth platforms, registered investment advisors, payment platforms, and public and private corporations. Developers include entrepreneurs, creators, merchants, crypto asset issuers, organizations and financial institutions, and other groups building decentralized protocols, applications, products, or other services onchain. Its transaction products include prime trading, base protocol, Coinbase Wallet, and others. The company also offers subscription products and other services.",
    "employeeTotal": 3772,
    "estimateCurrency": "USD",
    "exchange": "NASDAQ NMS - GLOBAL MARKET",
    "finnhubIndustry": "Financial Services",
    "floatingShare": 210.94,
    "fundamentalFreq": "q",
    "ggroup": "Financial Services",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Financial Exchanges & Data",
    "insiderOwnership": 1.8665,
    "institutionOwnership": 58.4886,
    "ipo": "2021-04-14",
    "irUrl": "http://investor.coinbase.com/home/default.aspx",
    "isin": "US19260Q1076",
    "lei": "5493004G3J2SC154DU06",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/COIN.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 88163.14692015998,
    "marketcapUSD": 0,
    "naics": "Activities Related to Credit Intermediation",
    "naicsNationalIndustry": "Financial Transactions Processing, Reserve, and Clearinghouse Activities",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Credit Intermediation and Related Activities",
    "name": "Coinbase Global Inc",
    "phone": "13026365401",
    "sedol": "BMC9P69",
    "shareOutstanding": 256.94,
    "state": "NEW YORK",
    "ticker": "COIN",
    "usShare": 0,
    "weburl": "https://www.coinbase.com/"
  }
}