{
  "symbol": "AIG",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:48:29.312396",
  "data": {
    "address": "1271 Ave Of The Americas, Fl 37",
    "alias": null,
    "city": "New York City",
    "country": "US",
    "currency": "USD",
    "cusip": "026874784",
    "description": "American International Group, Inc. is a global insurance organization, which provides property casualty insurance, offering a range of products, including liability, financial lines, property, global specialty, personal lines and accident and health that help businesses, individuals and jurisdictions to protect their assets and manage risks through AIG operations and network partners. The company is headquartered in New York City, New York and currently employs 22,200 full-time employees.  The company provides insurance solutions that help businesses and individuals in over 200 countries and jurisdictions protect their assets and manage risks through its operations, licenses and authorizations and network partners. Its segment includes General Insurance and Other Operations. General Insurance business includes its three segments, including North America Commercial, International Commercial and Global Personal. The North America Commercial consists of insurance businesses in the United States, Canada and Bermuda. The International Commercial consists of insurance businesses in Japan, the United Kingdom, Europe, Middle East and Africa, Asia Pacific, Latin America and Caribbean and China. The North America and International Commercial segment products include property and short tail, casualty, financial lines and global specialty. Global Personal segment products include global accident and health and personal lines.",
    "employeeTotal": 22200,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Insurance",
    "floatingShare": 552.36,
    "fundamentalFreq": "q",
    "ggroup": "Insurance",
    "gind": "Insurance",
    "gsector": "Financials",
    "gsubind": "Property & Casualty Insurance",
    "insiderOwnership": 0.2452,
    "institutionOwnership": 95.5635,
    "ipo": "1984-10-08",
    "irUrl": "https://www.aig.com/home/investor-relations",
    "isin": "US0268747849",
    "lei": "ODVCVCQG2BP6VHV36M30",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/AIG.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 43228.921759688674,
    "marketcapUSD": 0,
    "naics": "Insurance Carriers",
    "naicsNationalIndustry": "Direct Property and Casualty Insurance Carriers",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Insurance Carriers and Related Activities",
    "name": "American International Group Inc",
    "phone": "12127707000",
    "sedol": "2027342",
    "shareOutstanding": 554,
    "state": "NEW YORK",
    "ticker": "AIG",
    "usShare": 0,
    "weburl": "https://www.aig.com/home"
  }
}