{
  "symbol": "FTV",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:12.162679",
  "data": {
    "address": "6920 Seaway Blvd",
    "alias": null,
    "city": "Everett",
    "country": "US",
    "currency": "USD",
    "cusip": "34959J108",
    "description": "Fortive Corp. engages in the design, development, manufacturing, and marketing of professional and engineered products, software, and services for a variety of end markets. The company is headquartered in Everett, Washington and currently employs 18,000 full-time employees. The company went IPO on 2016-06-13. The firm's businesses design, develop, manufacture, and market products, software, and services, building on brand names, technologies, and market positions. The firm's segments include Intelligent Operating Solutions (IOS) and Advanced Healthcare Solutions (AHS). The firm's IOS segment provides advanced instrumentation, software and services to various customers enabling their mission-critical workflows. These offerings include electrical test and measurement, facility and asset lifecycle software applications, connected worker safety and compliance solutions across a range of vertical end markets. Its AHS segment supplies critical workflow solutions enabling healthcare providers to deliver patient care more efficiently. Its offerings include instrument sterilization solutions, instrument tracking, biomedical test tools, radiation detection and safety monitoring and end-to-end clinical productivity software and solutions.",
    "employeeTotal": 18000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Machinery",
    "floatingShare": 337.04,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Industrial Machinery & Supplies & Components",
    "insiderOwnership": 0.167,
    "institutionOwnership": 95.4468,
    "ipo": "2016-06-13",
    "irUrl": "https://investors.fortive.com/overview",
    "isin": "US34959J1088",
    "lei": "549300MU9YQJYHDQEF63",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/FTV.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 16520.96278050385,
    "marketcapUSD": 0,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Instruments and Related Products Manufacturing for Measuring, Displaying, and Controlling Industrial Process Variables",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Fortive Corp",
    "phone": "14254465000",
    "sedol": "BYT3MK1",
    "shareOutstanding": 338.34,
    "state": "WASHINGTON",
    "ticker": "FTV",
    "usShare": 0,
    "weburl": "https://www.fortive.com/"
  }
}