{
  "symbol": "CMI",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:47:35.397815",
  "data": {
    "address": "500 Jackson St, Box 3005 Mail Code 93050",
    "alias": null,
    "city": "Columbus",
    "country": "US",
    "currency": "USD",
    "cusip": "231021106",
    "description": "Cummins, Inc. engages in the design, manufacture, and distribution of diesel, natural gas, electric and hybrid powertrains and powertrain-related components including filtration, aftertreatment, turbochargers, fuel systems, valvetrain technologies, controls systems, air handling systems, automated transmissions, axles, drivelines, brakes, suspension systems, electric power generation systems, batteries, electrified power systems, hydrogen production technologies, and fuel cell products. The company is headquartered in Columbus, Indiana and currently employs 69,600 full-time employees.  The Company’s segments are Components, Engine, Distribution, Power Systems, and Accelera. Components segment designs, manufactures, and supplies products which include axles, drivelines, brakes, and suspension systems. Engine segment manufactures and markets a range of diesel and natural gas-powered engines under the Cummins brand name, for on and off-highway markets. Distribution segment includes sale and support of a range of products and services, including power generation systems, high-horsepower engines, heavy and medium duty engines, and others. Power Systems segment is a power provider, which designs, manufactures and sells engines for industrial applications, prime power generator sets, alternators, and others. Accelera segment designs, manufactures, sells, and supports electrified power systems with components and subsystems, including battery, fuel cell and electric powertrain and hydrogen production technologies.",
    "employeeTotal": 69600,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Machinery",
    "floatingShare": 137.29,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Machinery",
    "gsector": "Industrials",
    "gsubind": "Construction Machinery & Heavy Transportation Equipment",
    "insiderOwnership": 0.3116,
    "institutionOwnership": 86.4051,
    "ipo": "1964-09-10",
    "irUrl": "https://investor.cummins.com",
    "isin": "US2310211063",
    "lei": "ZUNI8PYC725B6H8JU438",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/CMI.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 58750.58345188942,
    "marketcapUSD": 0,
    "naics": "Engine, Turbine, and Power Transmission Equipment Manufacturing",
    "naicsNationalIndustry": "Other Engine Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Cummins Inc",
    "phone": "18123773842",
    "sedol": "2240202",
    "shareOutstanding": 137.79,
    "state": "INDIANA",
    "ticker": "CMI",
    "usShare": 0,
    "weburl": "https://www.cummins.com/"
  }
}