{
  "symbol": "HCA",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:18.013637",
  "data": {
    "address": "One Park Plaza",
    "alias": null,
    "city": "Nashville",
    "country": "US",
    "currency": "USD",
    "cusip": "40412C101",
    "description": "HCA Healthcare, Inc. is a health care services company engaged in operating hospitals, freestanding surgery centers and emergency care facilities, urgent care facilities, walk-in clinics, diagnostic and imaging centers, radiation and oncology therapy centers, comprehensive rehabilitation and physical therapy centers, physician practices, home health, hospice, outpatient physical therapy home and community-based services providers, and various other facilities. The company is headquartered in Nashville, Tennessee and currently employs 226,000 full-time employees. The company went IPO on 2010-12-28. The company owns, manages or operates hospitals, ambulatory surgery centers (ASCs), freestanding emergency care facilities, urgent care facilities, walk-in clinics, diagnostic and imaging centers, radiation and oncology therapy centers, comprehensive rehabilitation and physical therapy centers, hospices, and various other facilities. Its general, acute care hospitals provide a full range of services to accommodate such medical specialties as internal medicine, general surgery, cardiology, oncology, neurosurgery, orthopedics and obstetrics, as well as diagnostic and emergency services. Its behavioral hospitals provide a full range of mental health care services through inpatient, partial hospitalization and outpatient settings. The company operates approximately 190 hospitals and 2,400 ambulatory sites of care, including surgery centers, freestanding emergency rooms, urgent care centers and physician clinics, in 20 states and the United Kingdom.",
    "employeeTotal": 271000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Health Care",
    "floatingShare": 161.75,
    "fundamentalFreq": "q",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Providers & Services",
    "gsector": "Health Care",
    "gsubind": "Health Care Facilities",
    "insiderOwnership": 1.1763,
    "institutionOwnership": 65.9162,
    "ipo": "2010-12-28",
    "irUrl": "https://investor.hcahealthcare.com/overview",
    "isin": "US40412C1018",
    "lei": "529900PH4ZGUH2MNEU89",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/HCA.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 93845.43645392399,
    "marketcapUSD": 0,
    "naics": "General Medical and Surgical Hospitals",
    "naicsNationalIndustry": "General Medical and Surgical Hospitals",
    "naicsSector": "Health Care and Social Assistance",
    "naicsSubsector": "Hospitals",
    "name": "HCA Healthcare Inc",
    "phone": "16153449551",
    "sedol": "B4MGBG6",
    "shareOutstanding": 233.99,
    "state": "TENNESSEE",
    "ticker": "HCA",
    "usShare": 0,
    "weburl": "https://hcahealthcare.com/"
  }
}