{
  "symbol": "JCI",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:27.927271",
  "data": {
    "address": "One Albert Quay, Albert Quay",
    "alias": null,
    "city": "Cork",
    "country": "IE",
    "currency": "USD",
    "cusip": "G51502105",
    "description": "Johnson Controls International Plc engages in the provision of building products, energy solutions, integrated infrastructure and next generation transportation systems. The company is headquartered in Cork, Cork and currently employs 94,000 full-time employees.  The firm's segments include Americas, EMEA and APAC. The firm is engaged in engineering, manufacturing, commissioning and retrofitting building products and systems, including residential and commercial heating, ventilating, air-conditioning (HVAC) equipment, industrial refrigeration systems, controls, security systems, fire-detection systems and fire-suppression solutions. The firm also serves customers by providing technical services, including maintenance, management, repair, retrofit and replacement of equipment (in the HVAC, industrial refrigeration, controls, security and fire-protection space) and energy-management consulting. Its OpenBlue digital software platform enables enterprises to manage their physical spaces. The firm serves various industries, including healthcare, schools, data centers, airports, stadiums and manufacturing.",
    "employeeTotal": 94000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Building",
    "floatingShare": 652.73,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "insiderOwnership": 0.2396,
    "institutionOwnership": 92.7571,
    "ipo": "1991-08-22",
    "irUrl": "https://investors.johnsoncontrols.com/",
    "isin": "IE00BY7QL619",
    "lei": "",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/JCI.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 70987.73462747678,
    "marketcapUSD": 0,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air-Conditioning and Warm Air Heating Equipment and Commercial and Industrial Refrigeration Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Johnson Controls International PLC",
    "phone": "3534145241200",
    "sedol": "BY7QL61",
    "shareOutstanding": 654.39,
    "state": "CORK",
    "ticker": "JCI",
    "usShare": 0,
    "weburl": "https://www.johnsoncontrols.com/"
  }
}