{
  "symbol": "CARR",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:48:43.502903",
  "data": {
    "address": "13995 Pasteur Boulevard",
    "alias": null,
    "city": "Palm Beach Gardens",
    "country": "US",
    "currency": "USD",
    "cusip": "14448C104",
    "description": "Carrier Global Corp. engages in the provision of climate and energy solutions with a focus on providing differentiated, digitally-enabled lifecycle solutions to its customers. The company is headquartered in Palm Beach Gardens, Florida and currently employs 48,000 full-time employees. The company went IPO on 2020-03-17. The Company’s segment include Climate Solutions Americas, which provides products, controls, services and solutions to meet the heating, ventilation and cooling (HVAC) needs of residential and commercial customers in North and South America; Climate Solutions Europe segment provides products, controls, services and solutions to meet the HVAC needs of residential and commercial customers in Europe; Climate Solutions Asia Pacific, Middle East & Africa segment provides products, controls, services and solutions to meet the HVAC needs of residential and commercial customers in Asia Pacific, the Middle East and Africa; and Climate Solutions Transportation segment includes global transport refrigeration and monitoring products, services and digital solutions for trucks, trailers, shipping containers, intermodal and rail.",
    "employeeTotal": 48000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Building",
    "floatingShare": 799.6,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "insiderOwnership": 6.03,
    "institutionOwnership": 86.3708,
    "ipo": "2020-03-17",
    "irUrl": "https://ir.carrier.com/",
    "isin": "US14448C1045",
    "lei": "549300JE3W6CWY2NAN77",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/CARR.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 51997.49578381588,
    "marketcapUSD": 0,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air-Conditioning and Warm Air Heating Equipment and Commercial and Industrial Refrigeration Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Carrier Global Corp",
    "phone": "15613652000",
    "sedol": "BK4N0D7",
    "shareOutstanding": 851.02,
    "state": "FLORIDA",
    "ticker": "CARR",
    "usShare": 0,
    "weburl": "https://www.carrier.com/"
  }
}