{
  "symbol": "MA",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:38.182794",
  "data": {
    "address": "2000 Purchase St",
    "alias": null,
    "city": "Purchase",
    "country": "US",
    "currency": "USD",
    "cusip": "57636Q104",
    "description": "Mastercard, Inc. is a technology company, which engages in the provision of payment solutions for the development and implementation of credit, debit, prepaid, commercial, and payment programs through its brands including Mastercard, Maestro, and Cirrus. The company is headquartered in Purchase, New York and currently employs 35,300 full-time employees. The company went IPO on 2006-05-25. The firm connects consumers, financial institutions, merchants, governments, digital partners, businesses and other organizations worldwide by enabling electronic payments and making those payment transactions secure, simple, smart and accessible. The company provides a range of payment solutions and services using its brands, including Mastercard, Maestro and Cirrus. The company operates a payments network that provides choice and flexibility for consumers, merchants and its customers. Through its proprietary global payments network, it switches (authorizes, clears and settles) payment transactions. Its additional payments capabilities include automated clearing house (ACH) transactions (both batch and real-time account-based payments). The company offers security solutions, consumer acquisition and engagement, business and market insights, gateway, processing and open banking, among other services and solutions.",
    "employeeTotal": 35300,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Financial Services",
    "floatingShare": 892.51,
    "fundamentalFreq": "q",
    "ggroup": "Financial Services",
    "gind": "Financial Services",
    "gsector": "Financials",
    "gsubind": "Transaction & Payment Processing Services",
    "insiderOwnership": 0.0504,
    "institutionOwnership": 90.2897,
    "ipo": "2006-05-25",
    "irUrl": "https://investor.mastercard.com",
    "isin": "US57636Q1040",
    "lei": "AR5L2ODV9HN37376R084",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/MA.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 529796.1401769301,
    "marketcapUSD": 0,
    "naics": "Activities Related to Credit Intermediation",
    "naicsNationalIndustry": "Financial Transactions Processing, Reserve, and Clearinghouse Activities",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Credit Intermediation and Related Activities",
    "name": "Mastercard Inc",
    "phone": "19142492000",
    "sedol": "B121557",
    "shareOutstanding": 904.01,
    "state": "NEW YORK",
    "ticker": "MA",
    "usShare": 0,
    "weburl": "https://www.mastercard.us/"
  }
}