{
  "symbol": "AME",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:48:30.282426",
  "data": {
    "address": "1100 Cassatt Road",
    "alias": null,
    "city": "Berwyn",
    "country": "US",
    "currency": "USD",
    "cusip": "031100100",
    "description": "AMETEK, Inc. engages in the manufacture of electronic instruments and electromechanical devices. The company is headquartered in Berwyn, Pennsylvania and currently employs 21,500 full-time employees.  The firm's segments include Electronic Instruments Group (EIG) and Electromechanical Group (EMG). EIG segment designs and manufactures advanced analytical, test and measurement instruments for the process, aerospace, medical, research, power and industrial markets. The company provides a range of instruments to the research and laboratory equipment, ultra-precision manufacturing, optics, medical, and test and measurement markets. The company also provides three-dimensional measurement and imaging solutions, including portable measurement arms, laser scanners and trackers, software solutions, and comprehensive service offerings. EMG designs and manufactures engineered medical components and devices, automation solutions, thermal management systems, specialty metals and electrical interconnects. The company supplies powdered metals, strip and foil, specialty clad metals and metal matrix composites.",
    "employeeTotal": 21500,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Electrical Equipment",
    "floatingShare": 230.03,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Electrical Equipment",
    "gsector": "Industrials",
    "gsubind": "Electrical Components & Equipment",
    "insiderOwnership": 0.3204,
    "institutionOwnership": 88.604,
    "ipo": "1930-07-01",
    "irUrl": "https://investors.ametek.com",
    "isin": "US0311001004",
    "lei": "549300WZDEF9KKE40E98",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/AME.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 43581.010171994094,
    "marketcapUSD": 0,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Instruments and Related Products Manufacturing for Measuring, Displaying, and Controlling Industrial Process Variables",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "AMETEK Inc",
    "phone": "16106472121",
    "sedol": "2089212",
    "shareOutstanding": 230.95,
    "state": "PENNSYLVANIA",
    "ticker": "AME",
    "usShare": 0,
    "weburl": "https://www.ametek.com/"
  }
}