{
  "symbol": "MKTX",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:36.537020",
  "data": {
    "address": "55 Hudson Yards, 15th Floor",
    "alias": null,
    "city": "New York City",
    "country": "US",
    "currency": "USD",
    "cusip": "57060D108",
    "description": "MarketAxess Holdings, Inc. operates an electronic trading platform that allows investment industry professionals to trade corporate bonds and other types of fixed-income instruments. The company is headquartered in New York City, New York and currently employs 891 full-time employees. The company went IPO on 2004-11-05. The firm offers end-to-end trading solutions, including the operation of electronic platforms for the trading of fixed-income and other securities and related data, analytics compliance tools, post-trade services, automated trading services and technology services. The firm provides an Open Trading marketplace which offers an all-to-all trading solution in the global credit markets, creating a liquidity pool for a range of credit market participants. The company leverages its diverse set of trading protocols, automated and algorithmic trading solutions, intelligent data and index products and a range of post-trade services to provide an end-to-end trading solution to its robust network of platform participants. The firm also provides several integrated and actionable data offerings, including CP+ and Axess All, to assist clients. Its RFQ-hub platform is a bilateral multi-asset and multi-dealer request for quote platform.",
    "employeeTotal": 891,
    "estimateCurrency": "USD",
    "exchange": "NASDAQ NMS - GLOBAL MARKET",
    "finnhubIndustry": "Financial Services",
    "floatingShare": 36.53,
    "fundamentalFreq": "q",
    "ggroup": "Financial Services",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Financial Exchanges & Data",
    "insiderOwnership": 0.6696,
    "institutionOwnership": 101.6201,
    "ipo": "2004-11-05",
    "irUrl": "https://investor.marketaxess.com",
    "isin": "US57060D1081",
    "lei": "5493002U1CA1XJOVID83",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/MKTX.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 6714.643663758895,
    "marketcapUSD": 0,
    "naics": "Securities and Commodity Exchanges",
    "naicsNationalIndustry": "Securities and Commodity Exchanges",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Securities, Commodity Contracts, and Other Financial Investments and Related Activities",
    "name": "Marketaxess Holdings Inc",
    "phone": "12128316000",
    "sedol": "B03Q9D0",
    "shareOutstanding": 37.36,
    "state": "NEW YORK",
    "ticker": "MKTX",
    "usShare": 0,
    "weburl": "https://www.marketaxess.com/"
  }
}