{
  "symbol": "UBER",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:50:16.874167",
  "data": {
    "address": "1725 3Rd Street",
    "alias": null,
    "city": "San Francisco",
    "country": "US",
    "currency": "USD",
    "cusip": "90353T100",
    "description": "Uber Technologies, Inc. is a technology platform, which engages in the development and operation of technology applications, networks, and product to power movement from point A to point B. The company is headquartered in San Francisco, California and currently employs 31,100 full-time employees. The company went IPO on 2019-05-10. The company develops and operates technology applications supporting a variety of offerings on its platform (platform(s)). Its segments include Mobility, Delivery and Freight. Mobility products connect consumers with drivers who provide rides in a variety of vehicles, such as cars, auto rickshaws, motorbikes, minibuses, or taxis. Delivery offerings allow consumers to search for and discover local restaurants, order a meal, and either pick-up at the restaurant or have the meal delivered. In certain markets, the Delivery segment provides offerings for grocery, alcohol, and convenience store delivery as well as select other goods. The Freight segment connects carriers with shippers on its platform, and gives carriers upfront, pricing and the ability to book a shipment. The Freight segment also includes transportation management and other logistics service offerings.",
    "employeeTotal": 31100,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Road & Rail",
    "floatingShare": 2075.21,
    "fundamentalFreq": "q",
    "ggroup": "Transportation",
    "gind": "Ground Transportation",
    "gsector": "Industrials",
    "gsubind": "Passenger Ground Transportation",
    "insiderOwnership": 0.2006,
    "institutionOwnership": 83.9075,
    "ipo": "2019-05-10",
    "irUrl": "https://investor.uber.com/",
    "isin": "US90353T1007",
    "lei": "549300B2FTG34FILDR98",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/UBER.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 197489.14451723505,
    "marketcapUSD": 0,
    "naics": "Web Search Portals, Libraries, Archives, and Other Information Services",
    "naicsNationalIndustry": "Web Search Portals and All Other Information Services",
    "naicsSector": "Information",
    "naicsSubsector": "Web Search Portals, Libraries, Archives, and Other Information Services",
    "name": "Uber Technologies Inc",
    "phone": "14156128582",
    "sedol": "BK6N347",
    "shareOutstanding": 2085.42,
    "state": "CALIFORNIA",
    "ticker": "UBER",
    "usShare": 0,
    "weburl": "https://www.uber.com/"
  }
}