{
  "symbol": "ACN",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:48:23.869360",
  "data": {
    "address": "1 Grand Canal Square, Grand Canal Harbour, Dublin 2",
    "alias": null,
    "city": "DUBLIN",
    "country": "IE",
    "currency": "USD",
    "cusip": "G1151C101",
    "description": "Accenture is a global professional services company that helps the world’s businesses, governments and other organizations build their digital core, optimize their operations, accelerate revenue growth and enhance citizen services, creating tangible value at speed and scale. The company is headquartered in Dublin, Dublin and currently employs 774,000 full-time employees. The company went IPO on 2001-07-19. The company is engaged in providing a range of services and solutions across strategy and consulting, technology, operations, Industry X and Song. Its services include application services, artificial intelligence, automation, business process outsourcing, business strategy, change management, cloud, customer experience, data and analytics, ecosystem partners, finance consulting, Industry X, infrastructure, marketing, mergers and acquisitions, operating models, security, supply chain management, sustainability, technology consulting, technology innovation, and zero-based budgeting (ZBB). The company specializes in the SAP business technology platform that designs digital products and experiences for enterprise customers, including custom portals and Web solutions and mobile applications. The company provides clients with quantitative and qualitative risk management and compliance services. The company specializes in advisory, management services and cybersecurity.",
    "employeeTotal": 801000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Technology",
    "floatingShare": 622.31,
    "fundamentalFreq": "q",
    "ggroup": "Software & Services",
    "gind": "IT Services",
    "gsector": "Information Technology",
    "gsubind": "IT Consulting & Other Services",
    "insiderOwnership": 0.0653,
    "institutionOwnership": 80.2127,
    "ipo": "2001-07-19",
    "irUrl": "https://investor.accenture.com",
    "isin": "IE00B4BNMY34",
    "lei": "",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/ACN.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 149204.3583717176,
    "marketcapUSD": 0,
    "naics": "Computer Systems Design and Related Services",
    "naicsNationalIndustry": "Computer Systems Design Services",
    "naicsSector": "Professional, Scientific, and Technical Services",
    "naicsSubsector": "Professional, Scientific, and Technical Services",
    "name": "Accenture PLC",
    "phone": "35316462000",
    "sedol": "B4BNMY3",
    "shareOutstanding": 622.85,
    "state": "DUBLIN",
    "ticker": "ACN",
    "usShare": 0,
    "weburl": "https://www.accenture.com/ie-en/"
  }
}