{
  "symbol": "EBAY",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:47:42.613436",
  "data": {
    "address": "2025 Hamilton Avenue",
    "alias": null,
    "city": "San Jose",
    "country": "US",
    "currency": "USD",
    "cusip": "278642103",
    "description": "eBay, Inc. is a commerce company, whose platforms include an online marketplace and its localized counterparts, including off-platform businesses in South Korea, Japan, and Turkey, as well as eBay’s suite of mobile apps. The company is headquartered in San Jose, California and currently employs 11,500 full-time employees.  The firm's technology empowers buyers and sellers in more than 190 markets around the world. The firm's business includes its online marketplace located at www.ebay.com and its localized counterparts, its off-platform marketplaces and its suite of mobile apps. The company provides a number of features for its sellers and buyers that align with its approach of leveraging technology, including generative AI, to enhance the marketplace experience for its customers. For sellers, the Company is focused on simplifying their business processes to help drive their sales. The firm offers the eBay International Shipping program for sellers in the United States. For buyers, it is changing the way they find inventory through discovery, personalization and other experiences. The company launched Explore, an AI-powered shopping feed enabling users to browse a list of personalized recommendations based on their interests, style preferences, and sizes.",
    "employeeTotal": 11500,
    "estimateCurrency": "USD",
    "exchange": "NASDAQ NMS - GLOBAL MARKET",
    "finnhubIndustry": "Retail",
    "floatingShare": 455.88,
    "fundamentalFreq": "q",
    "ggroup": "Consumer Discretionary Distribution & Retail",
    "gind": "Broadline Retail",
    "gsector": "Consumer Discretionary",
    "gsubind": "Broadline Retail",
    "insiderOwnership": 0.2455,
    "institutionOwnership": 99.8727,
    "ipo": "1998-09-23",
    "irUrl": "https://investors.ebayinc.com/overview/default.aspx",
    "isin": "US2786421030",
    "lei": "OML71K8X303XQONU6T67",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/EBAY.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 40947.199583672744,
    "marketcapUSD": 0,
    "naics": "Other Miscellaneous Retailers",
    "naicsNationalIndustry": "All Other Miscellaneous Retailers",
    "naicsSector": "Retail Trade",
    "naicsSubsector": "Sporting Goods, Hobby, Musical Instrument, Book, and Miscellaneous Retailers",
    "name": "eBay Inc",
    "phone": "14083767400",
    "sedol": "2293819",
    "shareOutstanding": 457,
    "state": "CALIFORNIA",
    "ticker": "EBAY",
    "usShare": 0,
    "weburl": "https://www.ebayinc.com/"
  }
}