{
  "symbol": "HSIC",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:18.478848",
  "data": {
    "address": "135 Duryea Rd",
    "alias": null,
    "city": "Melville",
    "country": "US",
    "currency": "USD",
    "cusip": "806407102",
    "description": "Henry Schein, Inc. engages in the provision of health care products and services to medical, dental, and veterinary office-based practitioners. The company is headquartered in Melville, New York and currently employs 25,000 full-time employees.  Its segments consist of Global Distribution and Value-Added services, Global Specialty Services, and Global Technology. Global Distribution and Value-Added Services include the distribution to the global dental and medical markets of national brand and corporate brand merchandise, as well as equipment and related technical services. This segment also includes value-added services such as financial services, continuing education services, consulting and other services. This segment also markets and sells under its own brand, a portfolio of consumable merchandise. The Global Specialty Products includes the manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and orthopedic products and other healthcare-related products and services. Global Technology includes the development and distribution of practice management software, e-services, and other products.",
    "employeeTotal": 25000,
    "estimateCurrency": "USD",
    "exchange": "NASDAQ NMS - GLOBAL MARKET",
    "finnhubIndustry": "Health Care",
    "floatingShare": 102.46,
    "fundamentalFreq": "q",
    "ggroup": "Health Care Equipment & Services",
    "gind": "Health Care Providers & Services",
    "gsector": "Health Care",
    "gsubind": "Health Care Distributors",
    "insiderOwnership": 0.7461,
    "institutionOwnership": 94.7629,
    "ipo": "1995-11-03",
    "irUrl": "https://investor.henryschein.com",
    "isin": "US8064071025",
    "lei": "VGO3WGL8H45T73F4RR92",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/HSIC.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 8312.949303319727,
    "marketcapUSD": 0,
    "naics": "Professional and Commercial Equipment and Supplies Merchant Wholesalers",
    "naicsNationalIndustry": "Medical, Dental, and Hospital Equipment and Supplies Merchant Wholesalers",
    "naicsSector": "Wholesale Trade",
    "naicsSubsector": "Merchant Wholesalers, Durable Goods",
    "name": "Henry Schein Inc",
    "phone": "16318435500",
    "sedol": "2416962",
    "shareOutstanding": 121.27,
    "state": "NEW YORK",
    "ticker": "HSIC",
    "usShare": 0,
    "weburl": "https://www.henryschein.com/"
  }
}