{
  "symbol": "LII",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:33.314849",
  "data": {
    "address": "2140 Lake Park Blvd",
    "alias": null,
    "city": "Richardson",
    "country": "US",
    "currency": "USD",
    "cusip": "526107107",
    "description": "Lennox International, Inc. engages in the design, manufacture, and marketing of products for heating, ventilation, air conditioning, and refrigeration. The company is headquartered in Richardson, Texas and currently employs 14,200 full-time employees.  The firm designs, manufactures and markets a range of products for the heating, ventilation, air conditioning and refrigeration markets. The firm's segments include Home Comfort Solutions and Building Climate Solutions. Its Home Comfort Solutions segment's products and services include furnaces, air conditioners, heat pumps, packaged heating and cooling systems, indoor air quality equipment, replacement parts and supplies. Its brands include Lennox, Ducane, AirEase, Concord, MagicPak, and ADP Advanced Distributor Products. Its Building Climate Solutions segment's products and services include unitary heating and air conditioning equipment, applied systems, controls, installation and service of commercial heating and cooling equipment. Its brands include Enlight, Xion, Energence, Prodigy, and Strategos. The company sells its products and services through a combination of direct sales, distributors and Company-owned stores.",
    "employeeTotal": 14200,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Building",
    "floatingShare": 31.46,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "insiderOwnership": 10.2377,
    "institutionOwnership": 82.3389,
    "ipo": "1999-07-28",
    "irUrl": "https://www.lennoxinternational.com/investor-relations/events-calendar/",
    "isin": "US5261071071",
    "lei": "S7DWAC87RDMPBF77GJ92",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/LII.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 19028.228728887,
    "marketcapUSD": 0,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air-Conditioning and Warm Air Heating Equipment and Commercial and Industrial Refrigeration Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Lennox International Inc",
    "phone": "19724975000",
    "sedol": "2442053",
    "shareOutstanding": 35.12,
    "state": "TEXAS",
    "ticker": "LII",
    "usShare": 0,
    "weburl": "https://www.lennox.com/"
  }
}