{
  "symbol": "KVUE",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:28.737612",
  "data": {
    "address": "1 Kenvue Way",
    "alias": null,
    "city": "Summit",
    "country": "US",
    "currency": "USD",
    "cusip": "49177J102",
    "description": "Kenvue, Inc. is a consumer health company, which engages in manufacturing and selling healthcare products which includes cosmetics, drugs, and medical devices. The company is headquartered in Summit, New Jersey and currently employs 22,000 full-time employees. The company went IPO on 2023-05-04. The Company’s differentiated portfolio of brands includes Tylenol, Neutrogena, Listerine, Johnson’s, BAND-AID, Aveeno, Zyrtec, and Nicorette. The company operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. Its Self Care product categories include pain care; cough, cold, and allergy; digestive health; smoking cessation; eye care; and other products. Self Care segments include brands such as Tylenol, Motrin, Nicorette, Benadryl, Zyrtec, Zarbee’s, ORSLTM, Rhinocort, and Calpol. The Skin Health and Beauty segment is focused on face and body care, as well as hair, sun, and other products. The Essential Health segment includes oral care, baby care, women’s health, wound care, and other products. Its portfolio includes Self Care, Skin Health and Beauty, and Essential Health products which connect with consumers across North America, Asia Pacific (APAC), Europe, Middle East, and Africa (EMEA), and Latin America (LATAM).",
    "employeeTotal": 22000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Consumer products",
    "floatingShare": 1918.16,
    "fundamentalFreq": "q",
    "ggroup": "Household & Personal Products",
    "gind": "Personal Care Products",
    "gsector": "Consumer Staples",
    "gsubind": "Personal Care Products",
    "insiderOwnership": 0.0376,
    "institutionOwnership": 101.3906,
    "ipo": "2023-05-04",
    "irUrl": "https://investors.kenvue.com/overview/default.aspx",
    "isin": "US49177J1025",
    "lei": "",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/950835574756.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 34735.16410735551,
    "marketcapUSD": 0,
    "naics": "Soap, Cleaning Compound, and Toilet Preparation Manufacturing",
    "naicsNationalIndustry": "Toilet Preparation Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Chemical Manufacturing",
    "name": "Kenvue Inc",
    "phone": "19088741200",
    "sedol": "BQ84ZQ6",
    "shareOutstanding": 1919.07,
    "state": "NEW JERSEY",
    "ticker": "KVUE",
    "usShare": 0,
    "weburl": "https://www.kenvue.com"
  }
}