{
  "symbol": "GRMN",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:13.415124",
  "data": {
    "address": "Muehlentalstrasse 2",
    "alias": null,
    "city": "Schaffhausen",
    "country": "CH",
    "currency": "USD",
    "cusip": "H2906T109",
    "description": "Garmin Ltd. is a holding company, which engages in the provision of navigation, communications and information devices, most of which are enabled by Global Positioning System (GPS) technology. The company is headquartered in Schaffhausen, Schaffhausen and currently employs 21,800 full-time employees. The company went IPO on 2000-12-08. The firm and its subsidiaries offer global positioning system (GPS) navigation and wireless devices and applications. The firm operates through five segments: fitness, outdoor, aviation, marine and auto. The company offers a range of auto navigation products, as well as a range of products and applications designed for the mobile GPS market. The company offers Outdoor Handhelds, Wearable Devices, Golf Devices, and Dog Tracking and Training/Pet Obedience Devices. Garmin offers various products designed for use in fitness and activity tracking. Company’s aviation business segment is a provider of solutions to aircraft manufacturers, existing aircraft owners and operators, as well as military and government customers and serves a range of aircraft, including transport aircraft, business aviation, general aviation, experimental/light sport, helicopters, optionally piloted vehicles, and unmanned aerial vehicles. Company operates worldwide.",
    "employeeTotal": 21800,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Consumer products",
    "floatingShare": 163.45,
    "fundamentalFreq": "q",
    "ggroup": "Consumer Durables & Apparel",
    "gind": "Household Durables",
    "gsector": "Consumer Discretionary",
    "gsubind": "Consumer Electronics",
    "insiderOwnership": 15.0859,
    "institutionOwnership": 57.664,
    "ipo": "2000-12-08",
    "irUrl": "https://www.garmin.com/en-US/investors",
    "isin": "CH0114405324",
    "lei": "2549001E0HIPIJQ0W046",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/GRMN.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 45669.18637326095,
    "marketcapUSD": 0,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Search, Detection, Navigation, Guidance, Aeronautical, and Nautical System and Instrument Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Garmin Ltd",
    "phone": "41526301600",
    "sedol": "B3Z5T14",
    "shareOutstanding": 192.49,
    "state": "SCHAFFHAUSEN",
    "ticker": "GRMN",
    "usShare": 0,
    "weburl": "https://www.garmin.com/"
  }
}