{
  "symbol": "ALLE",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:48:26.667331",
  "data": {
    "address": "Block D Iveagh Court, Harcourt Road, Dublin 2",
    "alias": null,
    "city": "DUBLIN",
    "country": "IE",
    "currency": "USD",
    "cusip": "G0176J109",
    "description": "Allegion Plc engages in the provision of security products and solutions that keep people safe, secure, and productive. The company is headquartered in Dublin, Dublin and currently employs 14,400 full-time employees. The company went IPO on 2013-11-18. The firm secures people and assets with a range of solutions for homes, businesses, schools and institutions. Its Allegion Americas segment is a provider of security products, services and solutions throughout North America. The company sells a range of products and solutions, including locks, locksets, key systems, door controls and systems, exit devices, doors, accessories, electronic security products, access control systems and software and service solutions to customers in commercial, institutional, and residential facilities. Its Allegion International segment provides security products, services and solutions primarily throughout Europe, Asia and Oceania. The segment offers end-users a range of products, services and solutions, including locks, locksets, portable locks, key systems, door closers and systems, and others. Its brands include CISA, Interflex, LCN, Schlage, SimonsVoss, Von Duprin, Trimco and others.",
    "employeeTotal": 14400,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Building",
    "floatingShare": 84.84,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "insiderOwnership": 0.267,
    "institutionOwnership": 101.1921,
    "ipo": "2013-11-18",
    "irUrl": "https://investor.allegion.com/",
    "isin": "IE00BFRT3W74",
    "lei": "",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/ALLE.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 15347.64216744431,
    "marketcapUSD": 0,
    "naics": "Investigation and Security Services",
    "naicsNationalIndustry": "Security Systems Services (except Locksmiths)",
    "naicsSector": "Administrative and Support and Waste Management and Remediation Services",
    "naicsSubsector": "Administrative and Support Services",
    "name": "Allegion PLC",
    "phone": "353178103700",
    "sedol": "BFRT3W7",
    "shareOutstanding": 85.85,
    "state": "DUBLIN",
    "ticker": "ALLE",
    "usShare": 0,
    "weburl": "https://www.allegion.com/corp/en/index.html"
  }
}