{
  "symbol": "TT",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:50:15.001791",
  "data": {
    "address": "170/175 Lakeview Drive, Airside Business Park, Swords,",
    "alias": null,
    "city": "SWORDS",
    "country": "IE",
    "currency": "USD",
    "cusip": "G8994E103",
    "description": "Trane Technologies Plc engages in providing solutions to buildings, homes, and transportation. The company is headquartered in Swords, Dublin and currently employs 45,000 full-time employees.  Through its brands Trane and Thermo King, and its portfolio of products and services, it brings climate solutions to buildings, homes, and transportation. Its Americas segment serves customers in North America and Latin America and includes commercial heating, cooling, and ventilation systems, building controls and solutions, and energy services and solutions; residential heating and cooling; and transport refrigeration systems and solutions. Its EMEA segment serves customers in the Europe, Middle East and Africa region and includes heating, cooling and ventilation systems, services and solutions. Its Asia Pacific segment serves customers throughout the Asia Pacific region and includes heating, cooling and ventilation systems, services, and solutions. The company also offers autonomous heating, ventilation and air conditioning controls and generative artificial intelligence building technology.",
    "employeeTotal": 45000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Building",
    "floatingShare": 221.9,
    "fundamentalFreq": "q",
    "ggroup": "Capital Goods",
    "gind": "Building Products",
    "gsector": "Industrials",
    "gsubind": "Building Products",
    "insiderOwnership": 0.2622,
    "institutionOwnership": 90.2857,
    "ipo": "1906-10-10",
    "irUrl": "https://investors.tranetechnologies.com",
    "isin": "IE00BK9ZQ967",
    "lei": "",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/TT.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 89560.20758274994,
    "marketcapUSD": 0,
    "naics": "Ventilation, Heating, Air-Conditioning, and Commercial Refrigeration Equipment Manufacturing",
    "naicsNationalIndustry": "Air-Conditioning and Warm Air Heating Equipment and Commercial and Industrial Refrigeration Equipment Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Machinery Manufacturing",
    "name": "Trane Technologies PLC",
    "phone": "3537326527000",
    "sedol": "BK9ZQ96",
    "shareOutstanding": 222.52,
    "state": "DUBLIN",
    "ticker": "TT",
    "usShare": 0,
    "weburl": "https://www.tranetechnologies.com/"
  }
}