{
  "symbol": "SCHW",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:48:45.877163",
  "data": {
    "address": "3000 Schwab Way",
    "alias": null,
    "city": "Westlake",
    "country": "US",
    "currency": "USD",
    "cusip": "808513105",
    "description": "The Charles Schwab Corp. is a savings and loan holding company, which engages in the provision of wealth management, securities brokerage, banking, asset management, custody, and financial advisory services. The company is headquartered in Westlake, Texas and currently employs 32,600 full-time employees.  The Company, through its subsidiaries, engages in wealth management, securities brokerage, banking, asset management, custody, and financial advisory services. The firm provides financial services to individuals and institutional clients through two segments: Investor Services, and Advisor Services. The Investor Services segment provides retail brokerage, investment advisory, and banking and trust services to individual investors, and retirement plan and business services, as well as other corporate brokerage services, to businesses and their employees. The Advisor Services segment provides custodial, trading, banking and trust, and support services to independent registered investment advisors (RIAs), independent retirement advisors, and recordkeepers. Its products and services include brokerage, mutual funds, exchange-traded funds (ETFs), managed investing solutions, alternative investments, banking, and trust.",
    "employeeTotal": 32100,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Financial Services",
    "floatingShare": 1704.69,
    "fundamentalFreq": "q",
    "ggroup": "Financial Services",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Investment Banking & Brokerage",
    "insiderOwnership": 5.9838,
    "institutionOwnership": 84.8532,
    "ipo": "1987-09-22",
    "irUrl": "https://www.aboutschwab.com/investor-relations",
    "isin": "US8085131055",
    "lei": "549300VSGCJ7E698NM85",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/SCHW.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 169323.6438136571,
    "marketcapUSD": 0,
    "naics": "Other Financial Investment Activities",
    "naicsNationalIndustry": "Portfolio Management and Investment Advice",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Securities, Commodity Contracts, and Other Financial Investments and Related Activities",
    "name": "Charles Schwab Corp",
    "phone": "18178595000",
    "sedol": "2779397",
    "shareOutstanding": 1815.22,
    "state": "TEXAS",
    "ticker": "SCHW",
    "usShare": 0,
    "weburl": "https://www.schwab.com/"
  }
}