{
  "symbol": "GLW",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:47:33.222235",
  "data": {
    "address": "One Riverfront Plaza",
    "alias": null,
    "city": "Corning",
    "country": "US",
    "currency": "USD",
    "cusip": "219350105",
    "description": "Corning, Inc. engages in the provision of glass for notebook computers, flat panel desktop monitors, display televisions, and other information display applications, carrier network and enterprise network products for the telecommunications industry, ceramic substrates for gasoline and diesel engines in automotive and heavy-duty vehicle markets, laboratory products for the scientific community and polymer products for biotechnology applications, optical materials for the semiconductor industry and the scientific community, and polycrystalline silicon products and other technologies. The company is headquartered in Corning, New York and currently employs 56,300 full-time employees.  Its segments include Optical Communications, Display Technologies, Specialty Materials, Environmental Technologies, and Life Sciences. Its Optical Communications segment manufactures carrier network and enterprise network components for the telecommunications industry. Its Display Technologies segment manufactures glass substrates for flat-panel displays, including liquid crystal displays and organic light-emitting diodes. Its Specialty Materials segment manufactures products that provide material formulations for glass, glass ceramics and fluoride crystals for customer needs. Its Environmental Technologies segment manufactures ceramic substrates and filters for emission control systems in mobile applications. Its Life Sciences segment develops, manufactures and supplies laboratory products, including labware, equipment, media, serum and reagents, enabling workflow solutions for drug discovery and bioproduction.",
    "employeeTotal": 56300,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Electrical Equipment",
    "floatingShare": 785.8,
    "fundamentalFreq": "q",
    "ggroup": "Technology Hardware & Equipment",
    "gind": "Electronic Equipment, Instruments & Components",
    "gsector": "Information Technology",
    "gsubind": "Electronic Components",
    "insiderOwnership": 0.2143,
    "institutionOwnership": 78.6313,
    "ipo": "1945-05-21",
    "irUrl": "https://investor.corning.com",
    "isin": "US2193501051",
    "lei": "549300X2937PB0CJ7I56",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/GLW.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 68203.9795228127,
    "marketcapUSD": 0,
    "naics": "Glass and Glass Product Manufacturing",
    "naicsNationalIndustry": "Other Pressed and Blown Glass and Glassware Manufacturing",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Nonmetallic Mineral Product Manufacturing",
    "name": "Corning Inc",
    "phone": "16079749000",
    "sedol": "2224701",
    "shareOutstanding": 856.62,
    "state": "NEW YORK",
    "ticker": "GLW",
    "usShare": 0,
    "weburl": "https://www.corning.com/"
  }
}