{
  "symbol": "IBKR",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:49:24.041971",
  "data": {
    "address": "1 Pickwick Plz",
    "alias": null,
    "city": "Greenwich",
    "country": "US",
    "currency": "USD",
    "cusip": "45841N107",
    "description": "Interactive Brokers Group, Inc. is an investment holding company, which engages in broker or dealer and proprietary trading businesses. The company is headquartered in Greenwich, Connecticut and currently employs 3,087 full-time employees. The company went IPO on 2007-05-04. The firm custodies and services accounts for hedge and mutual funds, exchange-traded funds (ETFs), registered investment advisors, proprietary trading groups, introducing brokers and individual investors. The company specializes in routing orders and executing and processing trades in stocks, options, futures, foreign exchange instruments (forex), bonds, mutual funds, ETFs, precious metals, and forecast contracts on more than 160 electronic exchanges and market centers in 36 countries and 28 currencies around the world. In addition, its customers can use its trading platform to trade certain cryptocurrencies through third-party cryptocurrency service providers that execute, clear and custody the cryptocurrencies. Its trading platforms include IBKR Desktop, IBKR Trader Workstation, IBKR Mobile, IBKR Client Portal and others. Its key product offerings include IBKR Pro, IBKR Lite, and IBKR Universal Account.",
    "employeeTotal": 3087,
    "estimateCurrency": "USD",
    "exchange": "NASDAQ NMS - GLOBAL MARKET",
    "finnhubIndustry": "Financial Services",
    "floatingShare": 432.51,
    "fundamentalFreq": "q",
    "ggroup": "Financial Services",
    "gind": "Capital Markets",
    "gsector": "Financials",
    "gsubind": "Investment Banking & Brokerage",
    "insiderOwnership": 2.8154,
    "institutionOwnership": 87.2781,
    "ipo": "2007-05-04",
    "irUrl": "https://investors.interactivebrokers.com/",
    "isin": "US45841N1072",
    "lei": "5493004DT6DCDUZNDM53",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/IBKR.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 110352.3144,
    "marketcapUSD": 0,
    "naics": "Securities and Commodity Contracts Intermediation and Brokerage",
    "naicsNationalIndustry": "Investment Banking and Securities Intermediation",
    "naicsSector": "Finance and Insurance",
    "naicsSubsector": "Securities, Commodity Contracts, and Other Financial Investments and Related Activities",
    "name": "Interactive Brokers Group Inc",
    "phone": "12036185800",
    "sedol": "B1WT4X2",
    "shareOutstanding": 1699.82,
    "state": "CONNECTICUT",
    "ticker": "IBKR",
    "usShare": 0,
    "weburl": "https://www.interactivebrokers.com/en/home.php"
  }
}