{
  "symbol": "DHR",
  "data_type": "company_profile",
  "timestamp": "2025-09-19T14:47:36.039741",
  "data": {
    "address": "2200 Pennsylvania Ave NW Ste 800W",
    "alias": null,
    "city": "WASHINGTON",
    "country": "US",
    "currency": "USD",
    "cusip": "235851102",
    "description": "Danaher Corp. engages in the design, manufacture, and marketing of professional, medical, industrial, and commercial products and services. The company is headquartered in Washington, Washington Dc and currently employs 61,000 full-time employees.  The firm operates through three segments: Biotechnology, Life Sciences and Diagnostics. The Biotechnology segment includes the bioprocessing and discovery and medical businesses and offers a broad range of equipment, consumables and services that are primarily used by customers to advance and accelerate the research, development, manufacture and delivery of biological medicines. The Life Sciences segment offers a broad range of instruments, consumables, services and software that are primarily used by customers to study the basic building blocks of life, including deoxyribonucleic acid (DNA) and ribonucleic acid (RNA), nucleic acid, proteins, metabolites and cells. The Diagnostics segment offers clinical instruments, consumables, software and services that hospitals, physicians’ offices, reference laboratories and other critical care settings use to diagnose disease and make treatment decisions.",
    "employeeTotal": 62000,
    "estimateCurrency": "USD",
    "exchange": "NEW YORK STOCK EXCHANGE, INC.",
    "finnhubIndustry": "Life Sciences Tools & Services",
    "floatingShare": 638.06,
    "fundamentalFreq": "q",
    "ggroup": "Pharmaceuticals, Biotechnology & Life Sciences",
    "gind": "Life Sciences Tools & Services",
    "gsector": "Health Care",
    "gsubind": "Life Sciences Tools & Services",
    "insiderOwnership": 10.8219,
    "institutionOwnership": 81.9977,
    "ipo": "1969-12-10",
    "irUrl": "https://investors.danaher.com/",
    "isin": "US2358511028",
    "lei": "S4BKK9OTCEWQ3YHPFM11",
    "logo": "https://static2.finnhub.io/file/publicdatany/finnhubimage/stock_logo/DHR.svg",
    "marketCapCurrency": "USD",
    "marketCapitalization": 139823.39276217704,
    "marketcapUSD": 0,
    "naics": "Navigational, Measuring, Electromedical, and Control Instruments Manufacturing",
    "naicsNationalIndustry": "Instruments and Related Products Manufacturing for Measuring, Displaying, and Controlling Industrial Process Variables",
    "naicsSector": "Manufacturing",
    "naicsSubsector": "Computer and Electronic Product Manufacturing",
    "name": "Danaher Corp",
    "phone": "12028280850",
    "sedol": "2250870",
    "shareOutstanding": 716.05,
    "state": "WASHINGTON DC",
    "ticker": "DHR",
    "usShare": 0,
    "weburl": "https://www.danaher.com/"
  }
}